fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_Отпуска</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Enums/ВКМ_КатегорияСотрудника/ВКМ_КатегорияСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорияСотрудника</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>Управленец</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	АдресВХ = Неопределено;
	Если НЕ Параметры.Свойство("АдресВХ",АдресВХ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресВХ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Список = ПолучитьИзВременногоХранилища(АдресВХ);
	
	ПоказатьДиаграммуГанта(Список, Диаграмма);
	
КонецПроцедуры
#КонецОбласти



#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Процедура ПоказатьДиаграммуГанта(ТаблицаОтпусков, ДГанта)
	
	ДГанта.Обновление = Ложь;
	ДГанта.Очистить();
	
	ТаблицаСотрудники = ТаблицаОтпусков.Скопировать();
	ТаблицаСотрудники.Колонки.Добавить("Категория");
	Для Каждого Строка Из ТаблицаСотрудники Цикл
		Если Строка.Сотрудник.КатегорияСотрудника = Перечисления.ВКМ_КатегорияСотрудника.Специалист Тогда
			Строка.Категория = "Спец";
		Иначе
			Строка.Категория = "Упр";
		КонецЕсли;
	КонецЦикла;
	
		
	//ТаблицаСотрудники.ЗагрузитьКолонку(Сотрудники, "Сотрудник");
	ТаблицаСотрудники.Свернуть("Категория, Сотрудник");
	ТаблицаСотрудники.Сортировать("Категория, Сотрудник");
	
	ТекущаяСерия = ДГанта.УстановитьСерию("Отпуск");
	ТекущаяСерия.Цвет = WebЦвета.Аквамарин;
	ТекущаяСерия.Текст = "Отпуск";
	
	Для Каждого Сотрудник ИЗ ТаблицаСотрудники Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", Сотрудник.Сотрудник);
		ОтпускаСотрудника = ТаблицаОтпусков.НайтиСтроки(Отбор);

		ТекущаяТочка = Дганта.УстановитьТочку(Сотрудник.Сотрудник);
		ТекущаяТочка.Текст = Сотрудник.Сотрудник;
	
		ТекущееЗначение = ДГанта.ПолучитьЗначение(ТекущаяТочка,ТекущаяСерия);
		Для Каждого Отпуск Из ОтпускаСотрудника Цикл
			ТекущийИнтервал = ТекущееЗначение.Добавить();
			ТекущийИнтервал.Начало = Отпуск.ДатаНачала;
			ТекущийИнтервал.Конец = Отпуск.ДатаОкончания;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Точка Из ДГанта.Точки Цикл
		Если Точка.Значение.КатегорияСотрудника = Перечисления.ВКМ_КатегорияСотрудника.Специалист Тогда
			Точка.ЦветТекста = WebЦвета.СинийСоСтальнымОттенком;
			Точка.Текст = СтрШаблон("%1 (спец.)", Точка.Текст);
		Иначе
			Точка.Текст = СтрШаблон("%1 (админ.)", Точка.Текст);
		КонецЕсли;
	КонецЦикла;
	
	ДГанта.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Месяц;
	ДГанта.КратностьПериодическогоВарианта = 1;
	ДГанта.Обновление = Истина;
		

КонецПроцедуры

#КонецОбласти
